#include <iostream>

using namespace std;
/*Дан диаметр окружности d. Найти ее длину L = π·d. В качестве значе-
ния π использовать 3.14.*/
int main()
{
    int d;
    float l;
        cin>>d;
        l=3.14*d;
        cout<<l;
    return 0;
}
